Repository: HUGO-BENDER/ng8Chess
Catalog: src/assets/i18n/ResourcesVisualStudio/locale.*.resx
Languages: gl

# App.Languages.Catalan
source: Catalan
gl: Catalán

# App.Languages.English
source: English
gl: Inglés

# App.Languages.French
source: French
gl: Francés

# App.Languages.Galician
source: Galician
gl: Galego

# App.Languages.Spanish
source: Spanish
gl: Español

# App.SideNav.Select_lang
source: Select language
gl: Seleccionar idioma

# App.Title
source: Chess CrazyChess
gl: Xadrez CrazyChess

# App.MenuUser.AlertDisable
source: Disable alerts
gl: Desactivar as alertas

# App.MenuUser.AlertEnable
source: Enable alerts
gl: Activar alertas

# App.MenuUser.Login
source: Log in
gl: Iniciar sesión

# App.Msg.Cancel
source: Cancel
gl: Cancelar

# App.Msg.CloseSession
source: Sign off
gl: Pechar sesión

# App.Msg.confirmLogout
source: Are you sure you want to log out?
gl: Estás seguro de que queres pechar sesión?

# App.Msg.Exit
source: Get out
gl: Saír

# App.Msg.Welcome
source: Welcome {{value}}
gl: Benvido {{value}}

# App.SideNav.Actions
source: Actions
gl: Accións

# App.SideNav.Menu
source: Menu
gl: Menú

# Footer.Version
source: version
gl: versión

# ngxauthfirebaseui.emailConfirmationText
source: A confirmation e-mail has been sent to you.\n Check your inbox and click on the link \"Confirm my e-mail\" to confirm your e-mail address.
gl: Envioulle un correo electrónico de confirmación. \ N Comprobe a súa caixa de entrada e faga clic na ligazón \ "Confirmar o meu correo electrónico \" para confirmar o seu enderezo de correo electrónico.

# ngxauthfirebaseui.emailConfirmationTitle
source: Confirm your e-mail address!
gl: Confirma o teu enderezo de correo electrónico.

# ngxauthfirebaseui.emailErrorPatternText
source: Please enter a valid e-mail address
gl: Introduce un enderezo de correo electrónico válido

# ngxauthfirebaseui.emailErrorRequiredText
source: E-mail is required
gl: O correo electrónico é obrigatorio

# ngxauthfirebaseui.emailText
source: E-mail
gl: Correo electrónico

# ngxauthfirebaseui.forgotPasswordButtonText
source: Forgot Password?
gl: Esqueceu o seu contrasinal?

# ngxauthfirebaseui.guestButtonText
source: continue as guest
gl: continúa como convidado

# ngxauthfirebaseui.loginButtonText
source: Log in
gl: Iniciar sesión

# ngxauthfirebaseui.nameErrorMaxLengthText
source: The name is too long!
gl: O nome é moi longo!

# ngxauthfirebaseui.nameErrorMinLengthText
source: The name is too short!
gl: O nome é demasiado curto!

# ngxauthfirebaseui.nameErrorRequiredText
source: Name is required
gl: O nome é necesario

# ngxauthfirebaseui.nameText
source: Name
gl: Nome

# ngxauthfirebaseui.passwordErrorRequiredText
source: Password is required
gl: contrasinal é obrigatorio

# ngxauthfirebaseui.passwordText
source: Password
gl: Contrasinal

# ngxauthfirebaseui.registerButtonText
source: Register
gl: Inscrición

# ngxauthfirebaseui.registerCardTitleText
source: Registration
gl: Inscrición

# ngxauthfirebaseui.registerTabText
source: Register
gl: Inscrición

# ngxauthfirebaseui.resetPasswordActionButtonText
source: Reset
gl: Reiniciar

# ngxauthfirebaseui.resetPasswordErrorPatternText
source: Please enter a valid e-mail address
gl: Introduce un enderezo de correo electrónico válido

# ngxauthfirebaseui.resetPasswordErrorRequiredText
source: E-mail is required to reset the password!
gl: É necesario un correo electrónico para restablecer o contrasinal.

# ngxauthfirebaseui.resetPasswordInputText
source: Reset e-mail address to password
gl: Restablecer o enderezo de correo electrónico ao contrasinal

# ngxauthfirebaseui.resetPasswordInstructionsText
source: Reset requested. Check your e-mail instructions.
gl: Restablecido solicitado. Verifique as súas instrucións de correo electrónico.

# ngxauthfirebaseui.resetPasswordTabText
source: Reset e-mail address to password
gl: Restablecer o enderezo de correo electrónico ao contrasinal

# ngxauthfirebaseui.signInCardTitleText
source: Signing in
gl: Iniciar sesión

# ngxauthfirebaseui.signInTabText
source: Sign in
gl: Rexístrate

# pagAbout.Title
source: About us
gl: Sobre nós

# pagHome.CreateGame
source: New game
gl: Novo xogo

# pagHome.GamesInProgress
source: Games in progress
gl: Xogos en marcha

# pagHome.JoinGame
source: Join
gl: A unirse

# pagHome.SeparadorO
source: or
gl: ou

# pagHome.PlayNow
source: Play now!
gl: Xoga agora!

# pagHome.Title
source: Start
gl: Inicio

# App.Msg.Back
source: Previous
gl: Anterior

# App.Msg.Next
source: Following
gl: A continuación

# App.Msg.Reset
source: Restart
gl: Reiniciar

# Game.Chess.ChessColor.BLACK
source: Black
gl: Negro

# Game.Chess.ChessColor.RAMDOM
source: Random
gl: Ao azar

# Game.Chess.ChessColor.WHITE
source: White
gl: Branco

# Game.Chess.ColorLabel
source: Colour
gl: Cor

# Game.Chess.ColorSelect
source: Select your color
gl: Selecciona a túa cor

# Game.Chess.Title
source: Chess
gl: Xadrez

# Game.Shared.ChosseName
source: Choose a name for this game
gl: Escolla un nome para este xogo

# Game.Shared.ChosseNameHintLabel
source: 15 characters maximum
gl: 15 caracteres como máximo

# Game.Shared.CreateNewRecuitment
source: Create a new game
gl: Crea un xogo novo

# Game.Shared.GameConfig
source: Configuration
gl: Configuración

# Game.Shared.GameConfigSummary
source: Summary
gl: Resumo

# Game.Shared.GameDescriptionLabel
source: Description
gl: Descrición

# Game.Shared.GameDescriptionPlaceHolder
source: Optional: Enter a description
gl: Opcional: Introduza unha descrición

# Game.Shared.GameName
source: Name of the game
gl: Nome do xogo

# Game.Shared.GameNameIsRequired
source: The name of the game is mandatory
gl: O nome do xogo é obrigatorio

# Game.Shared.SendNewRecruitment
source: Submit
gl: Enviar

# Game.Chess.BlackCheck
source: Black moves. They are in check!
gl: Os negros móvense. Están en xaque!

# Game.Chess.BlackTurn
source: Black moves
gl: Os negros móvense

# Game.Chess.Check
source: Check the king
gl: Consulta o rei

# Game.Chess.Congratulations
source: CONGRATULATIONS
gl: CONGRATULACIÓNS

# Game.Chess.Draw
source: Boards. It's a tie.
gl: Táboas É un empate.

# Game.Chess.GameOver
source: The game is over
gl: O xogo rematou

# Game.Chess.InCheck
source: Your king is in check!
gl: O teu rei está en xaque.

# Game.Chess.Wait
source: You have to wait for opponent.
gl: Hai que esperar ao rival.

# Game.Chess.WhiteCheck
source: White moves. They are in check!
gl: O branco móvese. Están en xaque!

# Game.Chess.WhiteTurn
source: White moves
gl: O branco móvese

# Game.Chess.YouLost
source: Checkmate. Defeat.
gl: Comprobe Derrota

# Game.Chess.YouMove
source: It's your turn
gl: É a túa quenda

# Game.Chess.YouWin
source: Checkmate. Victory.
gl: Comprobe Victoria

# Game.Shared.Defeat
source: Defeat
gl: Derrota

# Game.Shared.SendTurn
source: Shift has been sent
gl: O cambio foi enviado

# Game.Shared.Victory
source: Victory
gl: Victoria

# pagHome.AbortQuickGame
source: Oh you won't play? We wait for you next time.
gl: Ah, non xogará? Agardámoste a próxima vez.

# pagHome.Completed
source: Full
gl: Completo

# pagHome.Delete
source: Remove
gl: Elimina

# pagHome.GameDelete
source: Game removed
gl: Xogo eliminado

# pagHome.Go
source: Go
gl: Vaia

# pagHome.InfoGame
source: More information
gl: Máis información

# pagHome.IsNotLogined
source: You cannot execute this action without being logged
gl: Non podes executar esta acción sen estar rexistrado

# pagHome.LastTurn
source: Last shift
gl: Última quenda

# pagHome.NewGameSuccess
source: You have created a game
gl: Creou un xogo

# pagHome.NoRecordsFound
source: There are no records
gl: Non hai rexistros

# pagHome.Open
source: Open
gl: Aberto

# pagHome.State
source: State
gl: Estado

# pagHome.Surrender
source: Leave
gl: Abandonar

# pagHome.Waiting
source: Waiting
gl: Agardando

# Game.Babydontcry.Subtitle
source: Move without waking them.
gl: Móvese sen espertalos.

# Game.Chess.Subtitle
source: Classic chess
gl: Xadrez clásico

# Game.Chinker.Subtitle
source: Card game
gl: Xogo de cartas

# Game.Crazychess.Subtitle
source: Let's change the rules
gl: Cambiamos as regras

# Game.Flow.Subtitle
source: Phaser game
gl: Xogo de fases
